In [67]:
# pip install pandas
# pip install numpy

# import library

import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [3]:
df["cust_id"]

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [4]:
df["item_bought"]

0    10
1    15
2    20
3    35
4     4
Name: item_bought, dtype: int64

In [5]:
df["city"]

0      Bandung
1      Jakarta
2        Bogor
3    Tangerang
4         Bali
Name: city, dtype: object

In [6]:
#Creating DataFrame from List of Lists

In [7]:
df = pd.DataFrame([["C1", 10, "Bandung"],
                  ["C2", 15, "Jakarta"],
                  ["C3", 20, "Bogor"],
                  ["C4", 35, "Tangerang"],
                  ["C5", 4, "Bali"]],
                  columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [8]:
#Creating DataFrame from Numpy Array

In [9]:
df = pd.DataFrame(np.array([["C1", 10, "Bandung"],
                  ["C2", 15, "Jakarta"],
                  ["C3", 20, "Bogor"],
                  ["C4", 35, "Tangerang"],
                  ["C5", 4, "Bali"]]),
                  columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1          10    Bandung
1      C2          15    Jakarta
2      C3          20      Bogor
3      C4          35  Tangerang
4      C5           4       Bali

In [10]:
#Creating DataFrame from Dictionary

In [11]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [12]:
#Saving a Dataframe

In [13]:
df.to_csv("customer.csv", index = False)
df.to_excel("customer.xlsx", index = False)

In [14]:
#Load a Dataframe

In [15]:
df = pd.read_csv("customer.csv")
df = pd.read_excel("customer.xlsx")

In [16]:
#Summary Info

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      5 non-null      object
 1   item_bought  5 non-null      int64
 2   city         5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [18]:
#Statistics of Numerical Columns

In [19]:
df.describe()

       item_bought
count     5.000000
mean     16.800000
std      11.777096
min       4.000000
25%      10.000000
50%      15.000000
75%      20.000000
max      35.000000

In [20]:
#Columns Name

In [21]:
df.columns

Index(['cust_id', 'item_bought', 'city'], dtype='object')

In [22]:
#DataFrame length

In [23]:
df.shape

(5, 3)

In [24]:
df.shape[0]

5

In [25]:
df.shape[1]

3

In [26]:
#Values of a particular column

In [27]:
df["cust_id"]

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [28]:
#Values of several columns

In [29]:
df[["cust_id","city"]]

  cust_id       city
0      C1    Bandung
1      C2    Jakarta
2      C3      Bogor
3      C4  Tangerang
4      C5       Bali

In [30]:
#First N rows

In [31]:
df.head()

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [32]:
df.head(2)

  cust_id  item_bought     city
0      C1           10  Bandung
1      C2           15  Jakarta

In [33]:
#Last N rows

In [34]:
df.tail()

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [35]:
df.tail(2)

  cust_id  item_bought       city
3      C4           35  Tangerang
4      C5            4       Bali

In [36]:
#Random N Rows

In [37]:
df.sample()

  cust_id  item_bought   city
2      C3           20  Bogor

In [38]:
df.sample(3)

  cust_id  item_bought       city
4      C5            4       Bali
3      C4           35  Tangerang
2      C3           20      Bogor

In [39]:
#Reordering Columns

In [40]:
df = df[["item_bought", "city", "cust_id"]]
df

   item_bought       city cust_id
0           10    Bandung      C1
1           15    Jakarta      C2
2           20      Bogor      C3
3           35  Tangerang      C4
4            4       Bali      C5

In [41]:
df = df.reindex(columns=["item_bought", "city", "cust_id"])
df

   item_bought       city cust_id
0           10    Bandung      C1
1           15    Jakarta      C2
2           20      Bogor      C3
3           35  Tangerang      C4
4            4       Bali      C5

In [42]:
#Get the value of specific row and column (via its name)

In [43]:
df.loc[0,"item_bought"]

10

In [44]:
df.loc[3,"city"]

'Tangerang'

In [45]:
#Get the value of specific row and column (via its index num)

In [46]:
df.iloc[0,0]

10

In [47]:
df.iloc[3,1]

'Tangerang'

In [48]:
#Get the specific ranges of rows and columns (via its name)

In [49]:
df.loc[0:2,["item_bought","city"]]

   item_bought     city
0           10  Bandung
1           15  Jakarta
2           20    Bogor

In [50]:
#Get the specific ranges of rows and columns (via its index num)

In [68]:
df.iloc[0:3, 0:2]

  cust_id  item_bought
0      C1           10
1      C2            7
2      C3            5

In [52]:
#Filter dataframe with a criteria

In [53]:
df[df["item_bought"]>15]

   item_bought       city cust_id
2           20      Bogor      C3
3           35  Tangerang      C4

In [ ]:
#Filter dataframe with several criterias (AND)

In [ ]:
df[(df["item_bought"]>15) & (df["city"]!="Bogor")]

In [ ]:
#Filter dataframe with several criterias (OR)

In [ ]:
df[(df["item_bought"]>15) | (df["city"]!="Bogor")]